In [5]:
import numpy as np
import pandas as pd

from pandas import DataFrame, Series

In [2]:
ser1 = Series(np.arange(3),index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int32

In [3]:
ser1.drop('b')

a    0
c    2
dtype: int32

In [9]:
dframe1 = DataFrame(np.arange(9).reshape((3,3)),index=['LDN','DON','SHEF'], columns=['pop','size','year'])
dframe1

      pop  size  year
LDN     0     1     2
DON     3     4     5
SHEF    6     7     8

In [10]:
dframe1.drop('LDN')

      pop  size  year
DON     3     4     5
SHEF    6     7     8

In [11]:
dframe2 = dframe1.drop('LDN')
dframe2

      pop  size  year
DON     3     4     5
SHEF    6     7     8

In [12]:
dframe1

      pop  size  year
LDN     0     1     2
DON     3     4     5
SHEF    6     7     8

In [14]:
dframe1.drop('year',axis=1)

      pop  size
LDN     0     1
DON     3     4
SHEF    6     7